#include "types.h"
#include "game/chrman.h"
#include "game/armem.h"
#include "game/audio.h"
#include "game/data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfex.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/humath.h"
#include "game/object.h"
#include "game/process.h"
#include "game/sprite.h"

#include "ext_math.h"
#include <string.h>

#ifndef __MWERKS__
#include "game/frand.h"
#endif

#include "data_num/effect.h"

typedef struct CharWork_s {
    /* 0x00 */ HU3DMODELID modelId;
    /* 0x02 */ s16 model;
    /* 0x04 */ s16 motNoCurr;
    /* 0x06 */ s16 motNoShiftCurr;
    /* 0x08 */ s16 motNoPrev;
    /* 0x0A */ s16 motNoShiftPrev;
    /* 0x0C */ HU3DMOTID motId[CHAR_MOT_MAX];
    /* 0x4C */ s16 motNoTbl[CHAR_MOT_MAX];
    /* 0x8C */ u8 voiceFlag[CHAR_MOT_MAX];
    /* 0xAC */ u32 attr;
    /* 0xB0 */ s8 stepFx;
    /* 0xB4 */ HuVecF pos;
    /* 0xC0 */ AMEM_PTR motAMemP;
    /* 0xC4 */ Process *process;
} CHARWORK; // Size 0xC8

typedef struct EffectData_s {
    /* 0x00 */ s32 dataNum;
    /* 0x04 */ s16 maxCnt;
    /* 0x06 */ s16 blendMode;
    /* 0x08 */ s32 motCnt;
} EFFECTDATA; // Size 0xC

typedef struct EffectParam_s {
    /* 0x00 */ u32 attr;
    /* 0x04 */ GXColor colorBegin;
    /* 0x08 */ GXColor colorEnd;
    /* 0x0C */ HuVecF vel;
    /* 0x18 */ HuVecF velDecay;
    /* 0x24 */ float gravity;
    /* 0x28 */ u32 zero;
    /* 0x2C */ float scaleVel;
    /* 0x30 */ float alphaBase;
    /* 0x34 */ float colorWeight;
} EFFECTPARAM; // Size 0x38

static void UpdateChar(void);
static void UpdateCharAnim(s16 charNo, HU3DMODELID modelId, s16 motNo, u8 voiceFlag, s16 frameNo, HuVecF *ofs);
static s32 _CharFXPlay(s16 charNo, s16 seNo, u8 voiceFlag);
static void EffectInit(void);
static s16 EffectDustCreate(s16 modelId, float posX, float posY, float posZ, float scale, EFFECTPARAM *param);
static s16 EffectSmokeCreate(s16 modelId, float posX, float posY, float posZ, float scale, EFFECTPARAM *param);
static s16 EffectDotCreate(s16 modelId, float posX, float posY, float posZ, float scale, EFFECTPARAM *param);
static s16 EffectStarCreate(s16 modelId, float posX, float posY, float posZ, float scale, EFFECTPARAM *param);
static s16 EffectWarnCreate(s16 modelId, float posX, float posY, float posZ, float scale, EFFECTPARAM *param);
static s16 EffectBirdCreate(s16 modelId, float posX, float posY, float posZ, float scale, EFFECTPARAM *param);
